; domain
(define (domain exercise0)
  (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality)
  (:types robot location object)
  (:predicates
    (at ?obj - (either robot object) ?loc - location)
    (holding ?r - robot ?obj - object)
    (inspected ?obj - object))
  (:action move
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (at ?r ?from) (not (= ?from ?to)))
    :effect (and (not (at ?r ?from)) (at ?r ?to)))
  (:action pick_up
    :parameters (?r - robot ?obj - object ?loc - location)
    :precondition (and (at ?r ?loc) (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (holding ?r ?obj)))
  (:action put_down
    :parameters (?r - robot ?obj - object ?loc - location)
    :precondition (holding ?r ?obj)
    :effect (and (not (holding ?r ?obj)) (at ?obj ?loc)))
  (:action visit
    :parameters (?r - robot ?loc1 - location ?loc2 - location)
    :precondition (or (at ?r ?loc1) (at ?r ?loc2))
    :effect (and (not (at ?r ?loc1)) (at ?r ?loc2)))
  (:action inspect
    :parameters (?r - robot ?obj - object ?loc - location)
    :precondition (or
      (and (at ?r ?loc) (at ?obj ?loc))
      (holding ?r ?obj))
    :effect (inspected ?obj))
)

; problem
(define (problem exercise0-problem-robot)
  (:domain exercise0)
  
  (:objects
    robot1 robot2 - robot
    loc1 loc2 loc3 - location
    box1 box2 - object)

  (:init
    (at robot1 loc1)
    (at robot2 loc2)
    (at box1 loc1)
    (at box2 loc3))

  (:goal
    (and
      (at robot1 loc2)
      (at box1 loc2)
      (at box2 loc1)
      (inspected box1)
      (inspected box2)))
)

; plan
1. (move robot2 loc2 loc3)
   deleted: (at robot2 loc2)
   added: (at robot2 loc3)
   goals met: 0 of 5
2. (inspect robot2 box2 loc3)
   added: (inspected box2)
   goals met: 1 of 5
3. (pick_up robot2 box2 loc3)
   deleted: (at box2 loc3)
   added: (holding robot2 box2)
   goals met: 1 of 5
4. (inspect robot1 box1 loc1)
   added: (inspected box1)
   goals met: 2 of 5
5. (pick_up robot1 box1 loc1)
   deleted: (at box1 loc1)
   added: (holding robot1 box1)
   goals met: 2 of 5
6. (move robot1 loc1 loc2)
   deleted: (at robot1 loc1)
   added: (at robot1 loc2)
   goals met: 3 of 5
7. (put_down robot2 box2 loc1)
   deleted: (holding robot2 box2)
   added: (at box2 loc1)
   goals met: 4 of 5
8. (put_down robot1 box1 loc2)
   deleted: (holding robot1 box1)
   added: (at box1 loc2)
   goals met: 5 of 5
